MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F035C8/mcu.h
/*!
 * @file        apm32f35.h
 *
 * @brief       CMSIS Cortex-M0 Device Peripheral Access Layer Header File.
 *
 * @details     This file contains all the peripheral register's definitions, bits definitions and memory mapping
 *
 * @version     V1.0.2
 *
 * @date        2024-10-31
 *
 * @attention
 *
 *  Copyright (C) 2022-2024 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#ifndef __APM32F035_H
#define __APM32F035_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/** @addtogroup CMSIS
  @{
*/

/** @defgroup APM32F035
  * @brief Peripheral Access Layer
  @{
*/

/** @defgroup Device_Macros
  @{
*/

#if defined (APM32F035x8)
#define    APM32F035
#endif /*!< APM32F035x8 */

// Note: Added for MikroE implementation.
#define APM32F035
#if !defined (APM32F035)
#error "Please select first the target APM32F035 device used in your application (in apm32f035.h file)"
#endif

/**@} end of group Device_Macros*/

/** @defgroup OSC_Macros
  @{
*/

#ifndef  HSE_VALUE
#define  HSE_VALUE              ((uint32_t)8000000)
#endif

/* Time out for HSE start up */
#define HSE_STARTUP_TIMEOUT     ((uint32_t)0x10000)

/* Time out for HSI start up */
#define HSI_STARTUP_TIMEOUT    ((uint32_t)0x0500)

/* Value of the Internal oscillator in Hz */
#define HSI_VALUE              ((uint32_t)8000000)
#define HSI14_VALUE            ((uint32_t)14000000)
#define LSE_VALUE              ((uint32_t)32768)
#define LSI_VALUE              ((uint32_t)40000)

/**@} end of group OSC_Macros*/

/** @defgroup APM32F035_StdPeripheral_Library_Version
  @{
*/

/*!< [31:16] APM32F035 Standard Peripheral Library main version V1.0.0*/
#define __APM32F035_DEVICE_VERSION_MAIN     (0x01) /*!< [31:24] main version */
#define __APM32F035_DEVICE_VERSION_SUB1     (0x00) /*!< [23:16] sub1 version */
#define __APM32F035_DEVICE_VERSION_SUB2     (0x00) /*!< [15:8]  sub2 version */
#define __APM32F035_DEVICE_VERSION_RC       (0x00) /*!< [7:0]  release candidate */
#define __APM32F035_DEVICE_VERSION          ((__APM32F035_DEVICE_VERSION_MAIN << 24)\
                                            |(__APM32F035_DEVICE_VERSION_SUB1 << 16)\
                                            |(__APM32F035_DEVICE_VERSION_SUB2 << 8 )\
                                            |(__APM32F035_DEVICE_VERSION_RC))

/**@} end of group APM32F035_StdPeripheral_Library_Version*/

/** @defgroup Configuraion_for_CMSIS
  @{
*/

/* Core Revision r0p1  */
#define __CM0PLUS_REV             0
/* APM32F035 do not provide MPU  */
#define __MPU_PRESENT             0
/* APM32F035 uses 2 Bits for the Priority Levels */
#define __NVIC_PRIO_BITS          2
/* Set to 1 if different SysTick Config is used */
#define __Vendor_SysTickConfig    0
/* Set to 1 if different Vector Table Offset is used */
#define __VTOR_PRESENT            1

/**
  * @}
  */

/**
 * @brief    Interrupt Number Definition
 */
typedef enum
{

    /*  Cortex-M0 Processor Exceptions Numbers */
    NonMaskableInt_IRQn       =  -14,             /*!< 2 Non Maskable Interrupt                                                 */
    HardFault_IRQn            =  -13,             /*!< 3 Cortex-M0 Hard Fault Interrupt                                         */
    SVC_IRQn                  =  -5,              /*!< 11 Cortex-M0 SV Call Interrupt                                           */
    PendSV_IRQn               =  -2,              /*!< 14 Cortex-M0 Pend SV Interrupt                                           */
    SysTick_IRQn              =  -1,              /*!< 15 Cortex-M0 System Tick Interrupt                                       */

#if defined (APM32F035)
    /*  APM32F035 specific Interrupt Numbers */
    WWDT_IRQn                 =   0,              /*!< Window Watchdog interrupt                                                */
    PVD_IRQn                  =   1,              /*!< PVD interrupt                                                            */
    RTC_IRQn                  =   2,              /*!< RTC interrupts                                                           */
    FLASH_IRQn                =   3,              /*!< FLASH global Interrupt                                                   */
    RCM_IRQn                  =   4,              /*!< RCC global interrupts                                                    */
    EINT0_1_IRQn              =   5,              /*!< EINT Line[1:0] interrupts                                                */
    EINT2_3_IRQn              =   6,              /*!< EINT Line[3:2] interrupts                                                */
    EINT4_15_IRQn             =   7,              /*!< EINT Line15 and EINT4 interrupts                                         */
    M0CP_IRQn                 =   8,              /*!< M0CP global interrupt                                                    */
    DMA_CH1_IRQn              =   9,              /*!< DMA channel 1 interrupt                                                  */
    DMA_CH2_3_IRQn            =  10,              /*!< DMA Channel 2 and 3                                                      */
    DMA_CH4_7_IRQn            =  11,              /*!< DMA Channel 4 to 7                                                       */
    ADC_COMP_IRQn             =  12,              /*!< ADC and comparator interrupts                                            */
    TMR1_BRK_UP_TRG_COM_IRQn  =  13,              /*!< TMR1 Break, Update, Trigger and Commutation Interrupt                    */
    TMR1_CC_IRQn              =  14,              /*!< TMR1 Capture Compare Interrupt                                           */
    TMR2_IRQn                 =  15,              /*!< TMR2 global interrupt                                                    */
    TMR3_IRQn                 =  16,              /*!< TMR3 global interrupt                                                    */
    TMR6_IRQn                 =  17,              /*!< TMR6 global interrupt                                                    */
    TMR4_IRQn                 =  19,              /*!< TMR4 global interrupt                                                    */
    TMR7_IRQn                 =  20,              /*!< TMR7 global interrupt                                                    */
    I2C_IRQn                  =  23,              /*!< I2C global interrupt                                                     */
    SPI_IRQn                  =  25,              /*!< SPI global interrupt                                                     */
    USART1_IRQn               =  27,              /*!< USART1 global interrupt                                                  */
    USART2_IRQn               =  28,              /*!< USART2 global interrupt                                                  */
    CAN_IRQn                  =  30               /*!< CAN global interrupt                                                     */
#endif
} IRQn_Type;

/**
  * @}
  */

#include "core_cm0plus.h"
// Note: Changed for MikroE implementation.
//#include "system_apm32f035.h"
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>

/** @defgroup Exported_Types
  @{
*/

