MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F035C8/mcu.h
    /* APB1 peripheral clock enable register*/
    union
    {
        __IOM uint32_t APBCLKEN1;

        struct
        {
            __IOM uint32_t TMR2EN     : 1;
            __IOM uint32_t TMR3EN     : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t TMR6EN     : 1;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t TMR4EN     : 1;
            __IM  uint32_t RESERVED3  : 2;
            __IOM uint32_t WWDTEN     : 1;
            __IM  uint32_t RESERVED4  : 5;
            __IOM uint32_t USART2EN   : 1;
            __IM  uint32_t RESERVED5  : 3;
            __IOM uint32_t I2CEN      : 1;
            __IM  uint32_t RESERVED6  : 3;
            __IOM uint32_t CANEN      : 1;
            __IM  uint32_t RESERVED7  : 2;
            __IOM uint32_t PMUEN      : 1;
            __IM  uint32_t RESERVED8  : 3;
        } APBCLKEN1_B;
    } ;

    /* RTC domain control register*/
    union
    {
        __IOM uint32_t RTCCTRL;

        struct
        {
            __IOM uint32_t LSEEN      : 1;
            __IM  uint32_t LSERDYFLG  : 1;
            __IOM uint32_t LSEBCFG    : 1;
            __IOM uint32_t LSEDRVCFG  : 2;
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t RTCSRCSEL  : 2;
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t RTCCLKEN   : 1;
            __IOM uint32_t RTCRST     : 1;
            __IM  uint32_t RESERVED3  : 15;
        } RTCCTRL_B;
    } ;

    /* Control/status register*/
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t LSIEN      : 1;
            __IM  uint32_t LSIRDYFLG  : 1;
            __IM  uint32_t RESERVED1  : 21;
            __IM  uint32_t PWRRSTFLG  : 1;
            __IOM uint32_t RSTFLGCLR  : 1;
            __IM  uint32_t OBRSTFLG   : 1;
            __IM  uint32_t PINRSTFLG  : 1;
            __IM  uint32_t PODRSTFLG  : 1;
            __IM  uint32_t SWRSTFLG   : 1;
            __IM  uint32_t IWDTRSTFLG : 1;
            __IM  uint32_t WWDTRSTFLG : 1;
            __IM  uint32_t LPWRRSTFLG : 1;
        } CSTS_B;
    } ;

    /* AHB peripheral reset register*/
    union
    {
        __IOM uint32_t AHBRST;

        struct
        {
            __IM  uint32_t RESERVED1  : 17;
            __IOM uint32_t PARST      : 1;
            __IOM uint32_t PBRST      : 1;
            __IOM uint32_t PCRST      : 1;
            __IM  uint32_t RESERVED2  : 2;
            __IOM uint32_t PFRST      : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t M0CPRST    : 1;
            __IM  uint32_t RESERVED4  : 7;
        } AHBRST_B;
    } ;

    /* Clock configuration register 2*/
    union
    {
        __IOM uint32_t CFG2;

        struct
        {
            __IOM uint32_t PLLDIVCFG  : 4;
            __IM  uint32_t RESERVED1  : 28;
        } CFG2_B;
    } ;

    /* Clock configuration register 3*/
    union
    {
        __IOM uint32_t CFG3;

        struct
        {
            __IOM uint32_t USART1SEL  : 2;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t I2CSEL     : 1;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t ADCSEL     : 1;
            __IM  uint32_t RESERVED3  : 23;
        } CFG3_B;
    } ;

    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t HSI14EN    : 1;
            __IM  uint32_t HSI14RDFLG : 1;
            __IOM uint32_t HSI14TO    : 1;
            __IOM uint32_t HSI14TRM   : 5;
            __IM  uint32_t HSI14CAL   : 8;
            __IM  uint32_t RESERVED1  : 16;
        } CTRL2_B;
    } ;
} RCM_T;

/**
  * @brief Option bytes (OB)
  */

typedef struct
{

    /* Read protection option byte */
    union
    {
        __IOM uint16_t READPROT;

        struct
        {
            __IOM uint16_t READPROT   : 8;
            __IOM uint16_t nREADPROT  : 8;
        } READPORT_B;
    } ;

    /* User protection option byte */
    union
    {
        __IOM uint16_t USER;

        struct
        {
            __IOM uint16_t WDTSEL     : 1;
            __IOM uint16_t RSTSTOP    : 1;
            __IOM uint16_t RSTSTDBY   : 1;
            __IM  uint16_t RESERVED1  : 1;
            __IOM uint16_t BOT1       : 1;
            __IOM uint16_t VDDAMON    : 1;
            __IM  uint16_t RESERVED2  : 1;
            __IM  uint16_t RESERVED3  : 1;
            __IOM uint16_t nUSER      : 8;
        } USER_B;
    } ;

    /* User data option byte */
    union
    {
        __IOM uint16_t DATA0;

        struct
        {
            __IOM uint16_t DATA0      : 8;
            __IOM uint16_t nDATA0     : 8;
        } DATA0_B;
    } ;

    /* User data option byte */
    union
    {
        __IOM uint16_t DATA1;

        struct
        {
            __IOM uint16_t DATA1      : 8;
            __IOM uint16_t nDATA1     : 8;
        } DATA1_B;
    } ;

    /* Write protection option byte */
    union
    {
        __IOM uint16_t WRTPROT0;

        struct
        {
            __IOM uint16_t WRTPROT0   : 8;
            __IOM uint16_t nWRTPROT0  : 8;
        } WRTPROT0_B;
    } ;

    /* Write protection option byte */
    union
    {
        __IOM uint16_t WRTPROT1;

        struct
        {
            __IOM uint16_t WRTPROT1   : 8;
            __IOM uint16_t nWRTPROT1  : 8;
        } WRTPROT1_B;
    } ;

    /* Write protection option byte */
    union
    {
        __IOM uint16_t WRTPROT2;

        struct
        {
            __IOM uint16_t WRTPROT2   : 8;
            __IOM uint16_t nWRTPROT2  : 8;
        } WRTPROT2_B;
    } ;

    /* Write protection option byte */
    union
    {
        __IOM uint16_t WRTPROT3;

        struct
        {
            __IOM uint16_t WRTPROT3   : 8;
            __IOM uint16_t nWRTPROT3  : 8;
        } WRTPROT3_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE0_7;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE0_7     : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE0_7    : 8;
        } ICODE_CIPHER_PAGE0_7_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE8_15;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE8_15    : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE8_15   : 8;
        } ICODE_CIPHER_PAGE8_15_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE16_23;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE16_23       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE16_23      : 8;
        } ICODE_CIPHER_PAGE16_23_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE24_31;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE24_31       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE24_31      : 8;
        } ICODE_CIPHER_PAGE24_31_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE32_39;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE32_39       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE32_39      : 8;
        } ICODE_CIPHER_PAGE32_39_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE40_47;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE40_47       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE40_47      : 8;
        } ICODE_CIPHER_PAGE40_47_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE48_55;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE48_55       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE48_55      : 8;
        } ICODE_CIPHER_PAGE48_55_B;
    } ;

    /* ICODE cipher page option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_PAGE56_63;

        struct
        {
            __OM  uint16_t ICODE_CIPHER_PAGE56_63       : 8;
            __IM  uint16_t nICODE_CIPHER_PAGE56_63      : 8;
        } ICODE_CIPHER_PAGE56_63_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE0_7;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE0_7     : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE0_7    : 8;
        } DCODE_CIPHER_PAGE0_7_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE8_15;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE8_15    : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE8_15   : 8;
        } DCODE_CIPHER_PAGE8_15_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE16_23;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE16_23       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE16_23      : 8;
        } DCODE_CIPHER_PAGE16_23_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE24_31;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE24_31       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE24_31      : 8;
        } DCODE_CIPHER_PAGE24_31_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE32_39;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE32_39       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE32_39      : 8;
        } DCODE_CIPHER_PAGE32_39_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE40_47;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE40_47       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE40_47      : 8;
        } DCODE_CIPHER_PAGE40_47_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE48_55;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE48_55       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE48_55      : 8;
        } DCODE_CIPHER_PAGE48_55_B;
    } ;

    /* DCODE cipher page option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_PAGE56_63;

        struct
        {
            __OM  uint16_t DCODE_CIPHER_PAGE56_63       : 8;
            __IM  uint16_t nDCODE_CIPHER_PAGE56_63      : 8;
        } DCODE_CIPHER_PAGE56_63_B;
    } ;

    /* ICODE cipher key select option byte */
    union
    {
        __IOM uint16_t ICODE_CIPHER_KEY_SEL;

        struct
        {
            __OM  uint16_t KEY_SEL                  : 2;
            __IM  uint16_t RESERVED1                : 6;
            __IM  uint16_t nICODE_CIPHER_KEY_SEL    : 8;
        } ICODE_CIPHER_KEY_SEL_B;
    } ;

    /* DCODE cipher key select option byte */
    union
    {
        __IOM uint16_t DCODE_CIPHER_KEY_SEL;

        struct
        {
            __OM  uint16_t KEY_SEL                  : 2;
            __OM  uint16_t OPT_ENC_SAME_KEY         : 1;
            __IM  uint16_t RESERVED1                : 5;
            __IM  uint16_t nDCODE_CIPHER_KEY_SEL    : 8;
        } DCODE_CIPHER_KEY_SEL_B;
    } ;

