MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F035C8/mcu.h
} OB_T;

/**
  * @brief Coprocessor for the ARM cortex-M0+ (M0CP)
  */

typedef struct
{
    /* control register */
    union
    {
        __IOM uint32_t CTRL_REG;

        struct
        {
            __OM  uint32_t RUN        : 1;
            __IOM uint32_t BANKAUTO   : 1;
            __IOM uint32_t BANKHSEL   : 1;
            __IOM uint32_t QN         : 4;
            __IOM uint32_t CORDICOUT  : 1;
            __IOM uint32_t SVPWMSEG   : 1;
            __IOM uint32_t SVPWMOUT   : 1;
            __IOM uint32_t TXEVEN     : 1;
            __IM  uint32_t RESERVED1  : 5;
            __IOM uint32_t ALG        : 4;
            __IM  uint32_t RESERVED2  : 12;
        } CTRL_REG_B;
    } ;

    /* state register */
    union
    {
        __IM  uint32_t STAT_REG;

        struct
        {
            __IM  uint32_t BUSY       : 1;
            __IM  uint32_t DIVERR     : 1;
            __IM  uint32_t OVF        : 1;
            __IM  uint32_t RESERVED1  : 29;
        } STAT_REG_B;
    } ;

    /* external interrupt state register */
    union
    {
        __IM  uint32_t TXIS_REG;

        struct
        {
            __IM  uint32_t DONE       : 1;
            __IM  uint32_t RESERVED1  : 31;
        } TXIS_REG_B;
    } ;

    /* original interrupt state register */
    union
    {
        __IOM uint32_t TXIR_REG;

        struct
        {
            __IOM uint32_t DONE       : 1;
            __IM  uint32_t RESERVED1  : 31;
        } TXIR_REG_B;
    } ;

    /* external interrupt enable register */
    union
    {
        __IOM uint32_t TXIE_REG;

        struct
        {
            __IOM uint32_t TXIEN      : 1;
            __IM  uint32_t RESERVED1  : 31;
        } TXIE_REG_B;
    } ;

    /* data X register */
    union
    {
        __IOM uint32_t X_REG;

        struct
        {
            __IOM uint32_t X_H       : 16;
            __IOM uint32_t X_L       : 16;
        } X_REG_B;
    } ;

    /* data Y register */
    union
    {
        __IOM uint32_t Y_REG;

        struct
        {
            __IOM uint32_t Y_H       : 16;
            __IOM uint32_t Y_L       : 16;
        } Y_REG_B;
    } ;

    /* data Z register */
    union
    {
        __IOM uint32_t Z_REG;

        struct
        {
            __IOM uint32_t Z_H       : 16;
            __IOM uint32_t Z_L       : 16;
        } Z_REG_B;
    } ;

    /* data W register */
    union
    {
        __IM  uint32_t W_REG;

        struct
        {
            __IOM uint32_t W_H       : 16;
            __IOM uint32_t W_L       : 16;
        } W_REG_B;
    } ;
    __IM  uint32_t  RESERVED[4];

    /* register block register */
    union
    {
        __IOM uint32_t BANK_REG;

        struct
        {
            __IOM uint32_t BANKWSEL   : 1;
            __IOM uint32_t BANKRSEL   : 1;
            __IM  uint32_t RESERVED1  : 30;
        } BANK_REG_B;
    } ;
    __IM  uint32_t  RESERVED1;

    /* version register */
    union
    {
        __IM  uint32_t REV_REG;

        struct
        {
            __IM  uint32_t MIN        : 8;
            __IM  uint32_t MID        : 8;
            __IM  uint32_t MAJ        : 8;
            __IM  uint32_t RESERVED1  : 8;
        } REV_REG_B;
    } ;
} M0CP_T;

/**
  * @brief Operational amplifier (OPA)
  */
typedef struct
{
    /* configuration register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t OPA1EN     : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t OPA1G      : 3;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t OPA2EN     : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t OPA2G      : 3;
            __IM  uint32_t RESERVED4  : 3;
            __IOM uint32_t OPA3EN     : 1;
            __IM  uint32_t RESERVED5  : 1;
            __IOM uint32_t OPA3G      : 3;
            __IM  uint32_t RESERVED6  : 3;
            __IOM uint32_t OPA4EN     : 1;
            __IM  uint32_t RESERVED7  : 1;
            __IOM uint32_t OPA4G      : 3;
            __IM  uint32_t RESERVED8  : 3;
        } CFG_B;
    } ;
} OPA_T;

/**
  * @brief Analog-to-digital converter (ADC)
  */

typedef struct
{
    /* interrupt and status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t ADCRDYFLG    : 1;
            __IOM uint32_t EOSMPFLG     : 1;
            __IOM uint32_t EOCFLG       : 1;
            __IOM uint32_t EOSEQFLG     : 1;
            __IOM uint32_t OVREFLG      : 1;
            __IM  uint32_t RESERVED1    : 2;
            __IOM uint32_t AWDFLG       : 1;
            __IOM uint32_t SEQ_NUM3_FIN : 1;
            __IOM uint32_t SEQ_NUM1_FIN : 1;
            __IOM uint32_t SEQ_NUM2_FIN : 1;
            __IM  uint32_t RESERVED2    : 21;
        } STS_B;
    } ;

    /* interrupt enable register */
    union
    {
        __IOM uint32_t IEN;

        struct
        {
            __IOM uint32_t ADCRDYIEN        : 1;
            __IOM uint32_t EOSMPIEN         : 1;
            __IOM uint32_t EOCIEN           : 1;
            __IOM uint32_t EOSEQIEN         : 1;
            __IOM uint32_t OVRIEN           : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t AWDIEN           : 1;
            __IOM uint32_t SEQ_NUM3_FINIEN  : 1;
            __IOM uint32_t SEQ_NUM1_FINIEN  : 1;
            __IOM uint32_t SEQ_NUM2_FINIEN  : 1;
            __IM  uint32_t RESERVED2        : 21;
        } IEN_B;
    } ;

    /* control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t ADCEN      : 1;
            __IOM uint32_t ADCD       : 1;
            __IOM uint32_t STARTCEN   : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t STOPCEN    : 1;
            __IM  uint32_t RESERVED2  : 26;
            __IOM uint32_t CAL        : 1;
        } CTRL_B;
    } ;

    /* configuration register 1 */
    union
    {
        __IOM uint32_t CFG1;

        struct
        {
            __IOM uint32_t DMAEN      : 1;
            __IOM uint32_t DMACFG     : 1;
            __IOM uint32_t SCANSEQDIR : 1;
            __IOM uint32_t DATARESCFG : 2;
            __IOM uint32_t DALIGCFG   : 1;
            __IOM uint32_t EXTTRGSEL1 : 4;
            __IOM uint32_t EXTPOLSEL1 : 2;
            __IOM uint32_t OVRMAG     : 1;
            __IOM uint32_t CMODESEL   : 1;
            __IOM uint32_t WAITCEN    : 1;
            __IOM uint32_t AOEN       : 1;
            __IOM uint32_t DISCEN     : 1;
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t AWDCHEN    : 1;
            __IOM uint32_t AWDEN      : 1;
            __IM  uint32_t RESERVED3  : 2;
            __IOM uint32_t AWDCHSEL   : 5;
            __IM  uint32_t RESERVED4  : 1;
        } CFG1_B;
    } ;

    /* configuration register 2 */
    union
    {
        __IOM uint32_t CFG2;

        struct
        {
            __IOM uint32_t SEQEN      : 1;
            __IM  uint32_t RESERVED1  : 7;
            __IOM uint32_t TGAP       : 15;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t CLKSEL     : 1;
            __IOM uint32_t PCLKDIV    : 3;
            __IOM uint32_t CLKCFG     : 2;
        } CFG2_B;
    } ;

